MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F105RB/mcu.h
    __IM  uint32_t  RESERVED[8];

    /* @brief Control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t FORRST          : 1;
            __IOM uint32_t PWRDOWN         : 1;
            __IOM uint32_t LPWREN          : 1;
            __IOM uint32_t FORSUS          : 1;
            __IOM uint32_t WUPREQ          : 1;
            __IM  uint32_t RESERVED1       : 3;
            __IOM uint32_t ESOFIEN         : 1;
            __IOM uint32_t SOFIEN          : 1;
            __IOM uint32_t RSTIEN          : 1;
            __IOM uint32_t SUSIEN          : 1;
            __IOM uint32_t WUPIEN          : 1;
            __IOM uint32_t ERRIEN          : 1;
            __IOM uint32_t PMAOUIEN        : 1;
            __IOM uint32_t CTRIEN          : 1;
            __IM  uint32_t RESERVED2       : 16;
        } CTRL_B;
    };

    /* @brief Interrupt status register */
    union
    {
        __IOM uint32_t INTSTS;

        struct
        {
            __IOM uint32_t EPID            : 4;
            __IOM uint32_t DOT             : 1;
            __IM  uint32_t RESERVED1       : 3;
            __IOM uint32_t ESOFFLG         : 1;
            __IOM uint32_t SOFFLG          : 1;
            __IOM uint32_t RSTREQ          : 1;
            __IOM uint32_t SUSREQ          : 1;
            __IOM uint32_t WUPREQ          : 1;
            __IOM uint32_t ERRFLG          : 1;
            __IOM uint32_t PMOFLG          : 1;
            __IOM uint32_t CTFLG           : 1;
            __IM  uint32_t RESERVED2       : 16;
        } INTSTS_B;
    };

    /* @brief Frame number register */
    union
    {
        __IM uint32_t FRANUM;

        struct
        {
            __IM  uint32_t FRANUM          : 11;
            __IM  uint32_t LSOFNUM         : 2;
            __IM  uint32_t LOCK            : 1;
            __IM  uint32_t RXDMSTS         : 1;
            __IM  uint32_t RXDPSTS         : 1;
            __IM  uint32_t RESERVED        : 16;
        } FRANUM_B;
    };

    /* @brief Device address register */
    union
    {
        __IOM uint32_t ADDR;

        struct
        {
            __IOM uint32_t ADDR            : 7;
            __IOM uint32_t USBDEN          : 1;
            __IM  uint32_t RESERVED        : 24;
        } ADDR_B;
    };

    /* @brief Buffer table address register */
    union
    {
        __IOM uint32_t BUFFTB;

        struct
        {
            __IM  uint32_t RESERVED1       : 3;
            __IOM uint32_t BUFFTB          : 13;
            __IM  uint32_t RESERVED2       : 16;
        } BUFFTB_B;
    };

    __IM  uint32_t  RESERVED1[43];

    /* @brief Buffer table address register  */
    union
    {
        __IOM uint32_t SWITCH;

        struct
        {
            __IOM uint32_t SWITCH           : 1;
            __IM  uint32_t RESERVED         : 31;
        } SWITCH_B;
    };
} USBD_T;

/**
  * @brief Ethernet: media access control (Ethernet_MAC)
  */

typedef struct
{

    union
    {
        __IOM uint32_t CFG;

        struct
        {
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t RXEN       : 1;
            __IOM uint32_t TXEN       : 1;
            __IOM uint32_t DC         : 1;
            __IOM uint32_t BL         : 2;
            __IOM uint32_t ACS        : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t DISR       : 1;
            __IOM uint32_t IPC        : 1;
            __IOM uint32_t DM         : 1;
            __IOM uint32_t LBM        : 1;
            __IOM uint32_t DISRXO     : 1;
            __IOM uint32_t SSEL       : 1;
            __IM  uint32_t RESERVED3  : 1;
            __IOM uint32_t DISCRS     : 1;
            __IOM uint32_t IFG        : 3;
            __IM  uint32_t RESERVED4  : 2;
            __IOM uint32_t JDIS       : 1;
            __IOM uint32_t WDTDIS     : 1;
        } CFG_B;
    } ;

    union
    {
        __IOM uint32_t FRAF;

        struct
        {
            __IOM uint32_t PR         : 1;
            __IOM uint32_t HUC        : 1;
            __IOM uint32_t HMC        : 1;
            __IOM uint32_t DAIF       : 1;
            __IOM uint32_t PM         : 1;
            __IOM uint32_t DISBF      : 1;
            __IOM uint32_t PCTRLF     : 1;
            __IOM uint32_t SAIF       : 1;
            __IOM uint32_t SAFEN      : 1;
            __IOM uint32_t HPF        : 1;
            __IM  uint32_t RESERVED1  : 21;
            __IOM uint32_t RXA        : 1;
        } FRAF_B;
    } ;

    union
    {
        __IOM uint32_t HTH;

        struct
        {
            __IOM uint32_t HTH        : 32;
        } HTH_B;
    } ;

    union
    {
        __IOM uint32_t HTL;

        struct
        {
            __IOM uint32_t HTL        : 32;
        } HTL_B;
    } ;

    union
    {
        __IOM uint32_t ADDR;

        struct
        {
            __IOM uint32_t MB         : 1;
            __IOM uint32_t MW         : 1;
            __IOM uint32_t CR         : 3;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t MR         : 5;
            __IOM uint32_t PA         : 5;
        } ADDR_B;
    } ;

    union
    {
        __IOM uint32_t DATA;

        struct
        {
            __IOM uint32_t MD         : 16;
        } DATA_B;
    } ;

    union
    {
        __IOM uint32_t FCTRL;

        struct
        {
            __IOM uint32_t FCTRLB     : 1;
            __IOM uint32_t TXFCTRLEN  : 1;
            __IOM uint32_t RXFCTRLEN  : 1;
            __IOM uint32_t UNPFDETE   : 1;
            __IOM uint32_t PTSEL      : 2;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t ZQPDIS     : 1;
            __IM  uint32_t RESERVED2  : 8;
            __IOM uint32_t PT         : 16;
        } FCTRL_B;
    } ;

    union
    {
        __IOM uint32_t VLANT;

        struct
        {
            __IOM uint32_t VLANTID    : 16;
            __IOM uint32_t VLANTCOMP  : 1;
        } VLANT_B;
    } ;
    __IM  uint32_t  RESERVED[2];
    __IOM uint32_t  REMWKUPFFL;

    union
    {
        __IOM  uint32_t PMTCTRLSTS;

        struct
        {
            __IOM  uint32_t PD        : 1;
            __IOM  uint32_t MPEN      : 1;
            __IOM  uint32_t WKUPFEN   : 1;
            __IM  uint32_t  RESERVED1 : 2;
            __IOM  uint32_t MPRX      : 1;
            __IOM  uint32_t WKUPFRX   : 1;
            __IM  uint32_t  RESERVED2 : 2;
            __IOM  uint32_t GUN       : 1;
            __IM  uint32_t  RESERVED3 : 21;
            __IOM  uint32_t WKUPFRST  : 1;
        } PMTCTRLSTS_B;
    } ;
    __IM  uint32_t  RESERVED1[2];

    union
    {
        __IOM uint32_t ISTS;

        struct
        {
            __IM  uint32_t RESERVED1  : 3;
            __IM  uint32_t PMTIS      : 1;
            __IM  uint32_t MMCIS      : 1;
            __IM  uint32_t MMCRXIS    : 1;
            __IM  uint32_t MMCTXIS    : 1;
            __IM  uint32_t RESERVED2  : 2;
            __IOM uint32_t TSIS       : 1;
        } ISTS_B;
    } ;

    union
    {
        __IOM uint32_t IMASK;

        struct
        {
            __IM  uint32_t RESERVED1  : 3;
            __IOM uint32_t PMTIM      : 1;
            __IM  uint32_t RESERVED2  : 5;
            __IOM uint32_t TSTIM      : 1;
        } IMASK_B;
    } ;

    union
    {
        __IOM uint32_t ADDR0H;

        struct
        {
            __IOM uint32_t ADDR0H     : 16;
            __IM  uint32_t RESERVED1  : 15;
            __IM  uint32_t AL1        : 1;
        } ADDR0H_B;
    } ;

    union
    {
        __IOM uint32_t ADDR0L;

        struct
        {
            __IOM uint32_t ADDR0L     : 32;
        } ADDR0L_B;
    } ;

    union
    {
        __IOM uint32_t ADDR1H;

        struct
        {
            __IOM uint32_t ADDR1H     : 16;
            __IM  uint32_t RESERVED1  : 8;
            __IOM uint32_t MASKBCTRL  : 6;
            __IOM uint32_t ADDRSEL    : 1;
            __IOM uint32_t ADDREN     : 1;
        } ADDR1H_B;
    } ;

    union
    {
        __IOM uint32_t ADDR1L;

        struct
        {
            __IOM uint32_t ADDR1L     : 32;
        } ADDR1L_B;
    } ;

    union
    {
        __IOM uint32_t ADDR2H;

        struct
        {
            __IOM uint32_t ADDR2H     : 16;
            __IM  uint32_t RESERVED1  : 8;
            __IOM uint32_t MASKBCTRL  : 6;
            __IOM uint32_t ADDRSEL    : 1;
            __IOM uint32_t ADDREN     : 1;
        } ADDR2H_B;
    } ;

    union
    {
        __IOM uint32_t ADDR2L;

        struct
        {
            __IOM uint32_t ADDR2L     : 31;
        } ADDR2L_B;
    } ;

    union
    {
        __IOM uint32_t ADDR3H;

        struct
        {
            __IOM uint32_t ADDR3H     : 16;
            __IM  uint32_t RESERVED1  : 8;
            __IOM uint32_t MASKBCTRL  : 6;
            __IOM uint32_t ADDRSEL    : 1;
            __IOM uint32_t ADDREN     : 1;
        } ADDR3H_B;
    } ;

    union
    {
        __IOM uint32_t ADDR3L;

        struct
        {
            __IOM uint32_t ADDR3L     : 32;
        } ADDR3L_B;
    } ;
    __IM  uint32_t  RESERVED2[40];

    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t CNTRST     : 1;
            __IOM uint32_t CNTSTOPRO  : 1;
            __IOM uint32_t RSTOR      : 1;
            __IOM uint32_t MCNTF      : 1;
            __IM  uint32_t RESERVED1  : 28;
        } CTRL_B;
    } ;

    union
    {
        __IOM uint32_t RXINT;

        struct
        {
            __IM  uint32_t RESERVED1  : 5;
            __IOM uint32_t RXFCE      : 1;
            __IOM uint32_t RXFAE      : 1;
            __IM  uint32_t RESERVED2  : 10;
            __IOM uint32_t RXGUNF     : 1;
        } RXINT_B;
    } ;

    union
    {
        __IOM uint32_t TXINT;

        struct
        {
            __IM  uint32_t RESERVED1  : 14;
            __IOM uint32_t TXGFSCOL   : 1;
            __IOM uint32_t TXGFMCOL   : 1;
            __IM  uint32_t RESERVED2  : 5;
            __IOM uint32_t TXGF       : 1;
        } TXINT_B;
    } ;

    union
    {
        __IOM uint32_t RXINTMASK;

        struct
        {
            __IM  uint32_t RESERVED1  : 5;
            __IOM uint32_t RXFCEM     : 1;
            __IOM uint32_t RXFAEM     : 1;
            __IM  uint32_t RESERVED2  : 10;
            __IOM uint32_t RXGUNFM    : 1;
        } RXINTMASK_B;
    } ;

    union
    {
        __IOM uint32_t TXINTMASK;

        struct
        {
            __IM  uint32_t RESERVED1  : 14;
            __IOM uint32_t TXGFSCOLM  : 1;
            __IOM uint32_t TXGFMCOLM  : 1;
            __IM  uint32_t RESERVED2  : 5;
            __IOM uint32_t TXGFM      : 1;
        } TXINTMASK_B;
    } ;
    __IM  uint32_t  RESERVED3[14];

    union
    {
        __IM  uint32_t TXGFSCCNT;

        struct
        {
            __IM  uint32_t TXGFSCCNT  : 32;
        } TXGFSCCNT_B;
    } ;

    union
    {
        __IM  uint32_t TXGFMCCNT;

        struct
        {
            __IM  uint32_t TXGFMCCNT  : 32;
        } TXGFMCCNT_B;
    } ;
    __IM  uint32_t  RESERVED4[5];

    union
    {
        __IM  uint32_t TXGFCNT;

        struct
        {
            __IM  uint32_t TXGFCNT    : 32;
        } TXGFCNT_B;
    } ;
    __IM  uint32_t  RESERVED5[10];

    union
    {
        __IM  uint32_t RXFCECNT;

        struct
        {
            __IM  uint32_t RXFCECNT   : 32;
        } RXFCECNT_B;
    } ;

    union
    {
        __IM  uint32_t RXFAECNT;

        struct
        {
            __IM  uint32_t RXFAECNT   : 32;
        } RXFAECNT_B;
    } ;
    __IM  uint32_t  RESERVED6[10];

    union
    {
        __IM  uint32_t RXGUNCNT;

        struct
        {
            __IM  uint32_t RXGUNCNT   : 32;
        } RXGUNCNT_B;
    } ;
    __IM  uint32_t  RESERVED7[334];

    union
    {
        __IOM uint32_t TSCTRL;

        struct
        {
            __IOM uint32_t TSEN       : 1;
            __IOM uint32_t TSUDSEL    : 1;
            __IOM uint32_t TSSTINIT   : 1;
            __IOM uint32_t TSSTUD     : 1;
            __IOM uint32_t TSTRGIEN   : 1;
            __IOM uint32_t TSADDUD    : 1;
        } TSCTRL_B;
    } ;

    union
    {
        __IOM uint32_t SUBSECI;

        struct
        {
            __IOM uint32_t STSUBSECI  : 8;
        } SUBSECI_B;
    } ;

    union
    {
        __IM  uint32_t TSH;

        struct
        {
            __IM  uint32_t STSEC      : 32;
        } TSH_B;
    } ;

    union
    {
        __IM  uint32_t TSL;

        struct
        {
            __IM  uint32_t STSUBSEC   : 31;
            __IM  uint32_t STSEL      : 1;
        } TSL_B;
    } ;

    union
    {
        __IOM uint32_t TSHUD;

        struct
        {
            __IOM uint32_t TSUDSEC    : 32;
        } TSHUD_B;
    } ;

    union
    {
        __IOM uint32_t TSLUD;

        struct
        {
            __IOM uint32_t TSUDSUBSEC : 31;
            __IOM uint32_t TSUDSEL    : 1;
        } TSLUD_B;
    } ;

    union
    {
        __IOM uint32_t TSA;

        struct
        {
            __IOM uint32_t TSA        : 32;
        } TSA_B;
    } ;

    union
    {
        __IOM uint32_t TTSH;

        struct
        {
            __IOM uint32_t TTSH       : 32;
        } TTSH_B;
    } ;

    union
    {
        __IOM uint32_t TTSL;

        struct
        {
            __IOM uint32_t TTSL       : 32;
        } TTSL_B;
    } ;
    __IM  uint32_t  RESERVED8[567];

    union
    {
        __IOM uint32_t DMABMOD;

        struct
        {
            __IOM uint32_t SWR        : 1;
            __IOM uint32_t DAS        : 1;
            __IOM uint32_t DSL        : 5;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t PBL        : 6;
            __IOM uint32_t PR         : 2;
            __IOM uint32_t FB         : 1;
            __IOM uint32_t RPBL       : 6;
            __IOM uint32_t USP        : 1;
            __IOM uint32_t PBLx4      : 1;
            __IOM uint32_t AAL        : 1;
        } DMABMOD_B;
    } ;

    union
    {
        __IOM uint32_t DMATXPD;

        struct
        {
            __IOM uint32_t TXPD       : 32;
        } DMATXPD_B;
    } ;

    union
    {
        __IOM uint32_t DMARXPD;

        struct
        {
            __IOM uint32_t RXPD       : 32;
        } DMARXPD_B;
    } ;

    union
    {
        __IOM uint32_t DMARXDLADDR;

        struct
        {
            __IOM uint32_t RXSTA      : 32;
        } DMARXDLADDR_B;
    } ;

    union
    {
        __IOM uint32_t DMATXDLADDR;

        struct
        {
            __IOM uint32_t TXSTA      : 32;
        } DMATXDLADDR_B;
    } ;

    union
    {
        __IOM uint32_t DMASTS;

        struct
        {
            __IOM uint32_t TXFLG      : 1;
            __IOM uint32_t TXSFLG     : 1;
            __IOM uint32_t TXBU       : 1;
            __IOM uint32_t TXJTO      : 1;
            __IOM uint32_t RXOVF      : 1;
            __IOM uint32_t TXUNF      : 1;
            __IOM uint32_t RXFLG      : 1;
            __IOM uint32_t RXBU       : 1;
            __IOM uint32_t RXSFLG     : 1;
            __IOM uint32_t RXWTOFLG   : 1;
            __IOM uint32_t ETXFLG     : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t FBERRFLG   : 1;
            __IOM uint32_t ERXFLG     : 1;
            __IOM uint32_t AINTS      : 1;
            __IOM uint32_t NINTS      : 1;
            __IM  uint32_t RXSTS      : 3;
            __IM  uint32_t TXSTS      : 3;
            __IM  uint32_t ERRB       : 3;
            __IM  uint32_t RESERVED2  : 1;
            __IM  uint32_t MMCFLG     : 1;
            __IM  uint32_t PMTFLG     : 1;
            __IM  uint32_t TSTFLG     : 1;
        } DMASTS_B;
    } ;

    union
    {
        __IOM uint32_t DMAOPMOD;

        struct
        {
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t STRX       : 1;
            __IOM uint32_t OSECF      : 1;
            __IOM uint32_t RXTHCTRL   : 2;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t FUF        : 1;
            __IOM uint32_t FERRF      : 1;
            __IM  uint32_t RESERVED3  : 5;
            __IOM uint32_t STTX       : 1;
            __IOM uint32_t TXTHCTRL   : 3;
            __IM  uint32_t RESERVED4  : 3;
            __IOM uint32_t FTXF       : 1;
            __IOM uint32_t TXSF       : 1;
            __IM  uint32_t RESERVED5  : 2;
            __IOM uint32_t DISFRXF    : 1;
            __IOM uint32_t RXSF       : 1;
            __IOM uint32_t DISDT      : 1;
        } DMAOPMOD_B;
    } ;

    union
    {
        __IOM uint32_t DMAINTEN;

        struct
        {
            __IOM uint32_t TXIEN      : 1;
            __IOM uint32_t TXSEN      : 1;
            __IOM uint32_t TXBUEN     : 1;
            __IOM uint32_t TXJTOEN    : 1;
            __IOM uint32_t RXOVFEN    : 1;
            __IOM uint32_t TXUNFEN    : 1;
            __IOM uint32_t RXIEN      : 1;
            __IOM uint32_t RXBUEN     : 1;
            __IOM uint32_t RXSEN      : 1;
            __IOM uint32_t RXWTOEN    : 1;
            __IOM uint32_t ETXIEN     : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t FBERREN    : 1;
            __IOM uint32_t ERXIEN     : 1;
            __IOM uint32_t AINTSEN    : 1;
            __IOM uint32_t NINTSEN    : 1;
        } DMAINTEN_B;
    } ;

    union
    {
        __IM  uint32_t DMAMFABOCNT;

        struct
        {
            __IM  uint32_t MISFCNT    : 16;
            __IM  uint32_t MISFCNTOVF : 1;
            __IM  uint32_t AMISFCNT   : 11;
            __IM  uint32_t OVFCNTOVF  : 1;
        } DMAMFABOCNT_B;
    } ;
    __IM  uint32_t  RESERVED9[9];

    union
    {
        __IM  uint32_t DMAHTXD;

        struct
        {
            __IM  uint32_t HTXDADDRP  : 32;
        } DMAHTXD_B;
    } ;

    union
    {
        __IM  uint32_t DMAHRXD;

        struct
        {
            __IM  uint32_t HRXDADDRP  : 32;
        } DMAHRXD_B;
    } ;

    union
    {
        __IM  uint32_t DMAHTXBADDR;

        struct
        {
            __IM  uint32_t HTXBADDRP  : 32;
        } DMAHTXBADDR_B;
    } ;

    union
    {
        __IM  uint32_t DMAHRXBADDR;

        struct
        {
            __IM  uint32_t HRXBADDRP  : 32;
        } DMAHRXBADDR_B;
    } ;
} ETH_T;

/**@} end of group Peripheral_registers_structures*/

/** @defgroup Peripheral_memory_map
  @{
*/

